[{
    "id": 1,
    "subject": "A Vietnamese Question Answering System in Vietnam’s Legal Documents",
    "abstract": "In this paper, we develop a Vietnamese Question Answering system to answer simple questions about provisions, processes, procedures, and sanctions in law on enterprises Vietnam. Research to build a Vietnamese Question Answering system is more difficult than English Question Answering system because of lack of Vietnamese processing resources and tools, or their results isn’t high. We have utilized available Vietnamese resources, tools and modified some tools (such as Lucene) and algorithms, which worked well in English, applies in Vietnamese. From that, we have proposed a similarity-based model to build a Vietnamese Question Answering system in Vietnam’s legal documents, namely vLawyer system. In experimental section, we achieved promising result, about 70% precision in legal documents, it proved that our approach is reasonable in legal document domain.",
    "year": 2014,
    "doi": "https://doi.org/10.1007/978-3-662-45237-0_19",
    "authors": "Huu-Thanh Duong, Bao-Quoc Ho",
    "ref": "<strong>H.-T. Duong</strong> and B.-Q. Ho, “A Vietnamese Question Answering System in Vietnam’s Legal Documents,” in Computer Information Systems and Industrial Management, vol. 8838, K. Saeed and V. Snášel, Eds. Berlin, Heidelberg: Springer Berlin Heidelberg, 2014, pp. 186–197. doi: 10.1007/978-3-662-45237-0_19.",
    "order": 1
}, {
    "id": 2,
    "subject": "Question Answering Based on Ensemble Classifier for University Enrolment Advising",
    "abstract": "Enrolment Advising (EA) for Vietnamese Universities takes place many sites in Vietnam every year, from the high schools to the universities. Many sessions have been organized, both online and offline. It costs a lot of human resources and money for inviting the experts, printing the leaflets, banner, poster, etc. In this context, we try to reduce the costs for EA by an application of machine learning. So, we propose to develop an automatic university enrolment advising system by using ensemble classifier.",
    "year": 2019,
    "doi": "https://doi.org/10.1109/KST.2019.8687616",
    "authors": "<strong>Huu Thanh Duong</strong>, Vinh Truong Hoang",
    "ref": "<strong>H.-T. Duong</strong> and V. Truong Hoang, “Question Answering Based on Ensemble Classifier for University Enrolment Advising,” in 2019 11th International Conference on Knowledge and Smart Technology (KST), Phuket, Thailand, Jan. 2019, pp. 35–39. doi: 10.1109/KST.2019.8687616.",
    "order": 2
}, {
    "id": 3,
    "subject": "A Survey on the Multiple Classifier for New Benchmark Dataset of Vietnamese News Classification",
    "abstract": "In this paper, we have summarized the well-known multi-class classifiers in the literature and applied them to evaluate on a new benchmark dataset of Vietnamese News (VNNews-01). This database is created from more than thirty Vietnamese online newspaper websites and grouped into twenty five categories. The proposition and evaluation of this work might promote the related research for Vietnamese text mining.",
    "year": 2019,
    "doi": "http://dx.doi.org/10.1109/KST.2019.8687509",
    "authors": "Huu-Thanh Duong, Vinh Truong Hoang",
    "ref": "<strong>H.-T. Duong</strong> and V. Truong Hoang, “A Survey on the Multiple Classifier for New Benchmark Dataset of Vietnamese News Classification,” in 2019 11th International Conference on Knowledge and Smart Technology (KST), Phuket, Thailand, Jan. 2019, pp. 23–28. doi: 10.1109/KST.2019.8687509.",
    "order": 3
}, {
    "id": 4,
    "subject": "A Vietnamese Sentiment Analysis System Based on Multiple Classifiers with Enhancing Lexicon Features",
    "abstract": "Today, a customer is easy to express his opinions about a bought products thanks to accelerated development of social networks and ecommerce websites. These opinions are very useful indicators to evaluate the degree of the customers’ real satisfaction. From that, the traders will emerge the strategies and predict the trends to get the directions for their products and businesses in the future. In this paper, we have built a dataset and executed many experiments based on the multiple classifiers with complementing lexicon features to increase the accuracy of sentiment polarities. The experimental section shows good results and proves our approach is reasonable.",
    "year": 2020,
    "doi": "http://dx.doi.org/10.1007/978-3-030-30149-1_20",
    "authors": "Bich-Tuyen Nguyen-Thi, Huu-Thanh Duong",
    "ref": "B.-T. Nguyen-Thi and <strong>H.-T. Duong</strong>, “A Vietnamese Sentiment Analysis System Based on Multiple Classifiers with Enhancing Lexicon Features,” in Industrial Networks and Intelligent Systems, vol. 293, T. Q. Duong, N.-S. Vo, L. K. Nguyen, Q.-T. Vien, and V.-D. Nguyen, Eds. Cham: Springer International Publishing, 2019, pp. 240–249. doi: 10.1007/978-3-030-30149-1_20.",
    "order": 4
}, {
    "id": 5,
    "subject": "One-Document Training for Vietnamese Sentiment Analysis",
    "abstract": "The traditional studies which have based on machine learning are usually supervised learning for sentiment analysis problem, this is costly time and money to build pre-labeled dataset, not domain adaptation and hard to handle unseen data. In this paper, we have approached semi-supervised learning for Vietnamese sentiment analysis, training data is only one document. Many preprocessing techniques have been performed to clean and normalize data, complemented semantic lexicons such as negation handling, intensification handling, also augmented training data from one-document training. In experiments, we have performed various aspects and obtained competitive results which may motivate next propositions.",
    "year": 2020,
    "doi": "http://dx.doi.org/10.1007/978-3-030-34980-6_21",
    "authors": "Dang-Khoa Nguyen-Nhat, Huu-Thanh Duong",
    "ref": "D.-K. Nguyen-Nhat and <strong>H.-T. Duong</strong>, “One-Document Training for Vietnamese Sentiment Analysis,” in Computational Data and Social Networks, vol. 11917, A. Tagarelli and H. Tong, Eds. Cham: Springer International Publishing, 2019, pp. 189–200. doi: 10.1007/978-3-030-34980-6_21.",
    "order": 5
}, {
    "id": 6,
    "subject": "A review: preprocessing techniques and data augmentation for sentiment analysis",
    "abstract": "In literature, the machine learning-based studies of sentiment analysis are usually supervised learning which must have pre-labeled datasets to be large enough in certain domains. Obviously, this task is tedious, expensive and time-consuming to build, and hard to handle unseen data. This paper has approached semi-supervised learning for Vietnamese sentiment analysis which has limited datasets. We have summarized many preprocessing techniques which were performed to clean and normalize data, negation handling, intensification handling to improve the performances. Moreover, data augmentation techniques, which generate new data from the original data to enrich training data without user intervention, have also been presented. In experiments, we have performed various aspects and obtained competitive results which may motivate the next propositions.",
    "year": 2021,
    "doi": "https://computationalsocialnetworks.springeropen.com/articles/10.1186/s40649-020-00080-x",
    "authors": "Huu-Thanh Duong, Tram-Anh Nguyen-Thi",
    "ref": "<strong>H.-T. Duong</strong> and T.-A. Nguyen-Thi, “A review: preprocessing techniques and data augmentation for sentiment analysis,” Comput Soc Netw, vol. 8, no. 1, p. 1, Dec. 2021, doi: 10.1186/s40649-020-00080-x.",
    "order": 6
}]