[{
    "id": 1,
    "subject": "A Vietnamese Question Answering System in Vietnam’s Legal Documents",
    "abstract": "In this paper, we develop a Vietnamese Question Answering system to answer simple questions about provisions, processes, procedures, and sanctions in law on enterprises Vietnam. Research to build a Vietnamese Question Answering system is more difficult than English Question Answering system because of lack of Vietnamese processing resources and tools, or their results isn’t high. We have utilized available Vietnamese resources, tools and modified some tools (such as Lucene) and algorithms, which worked well in English, applies in Vietnamese. From that, we have proposed a similarity-based model to build a Vietnamese Question Answering system in Vietnam’s legal documents, namely vLawyer system. In experimental section, we achieved promising result, about 70% precision in legal documents, it proved that our approach is reasonable in legal document domain.",
    "year": 2014,
    "doi": "https://doi.org/10.1007/978-3-662-45237-0_19",
    "authors": "Huu-Thanh Duong, Bao-Quoc Ho",
    "ref": "<strong>H.-T. Duong</strong> and B.-Q. Ho, “A Vietnamese Question Answering System in Vietnam’s Legal Documents,” in Computer Information Systems and Industrial Management, vol. 8838, K. Saeed and V. Snášel, Eds. Berlin, Heidelberg: Springer Berlin Heidelberg, 2014, pp. 186–197. doi: 10.1007/978-3-662-45237-0_19.",
    "order": 1
}, {
    "id": 2,
    "subject": "Question Answering Based on Ensemble Classifier for University Enrolment Advising",
    "abstract": "Enrolment Advising (EA) for Vietnamese Universities takes place many sites in Vietnam every year, from the high schools to the universities. Many sessions have been organized, both online and offline. It costs a lot of human resources and money for inviting the experts, printing the leaflets, banner, poster, etc. In this context, we try to reduce the costs for EA by an application of machine learning. So, we propose to develop an automatic university enrolment advising system by using ensemble classifier.",
    "year": 2019,
    "doi": "https://doi.org/10.1109/KST.2019.8687616",
    "authors": "<strong>Huu Thanh Duong</strong>, Vinh Truong Hoang",
    "ref": "<strong>H.-T. Duong</strong> and V. Truong Hoang, “Question Answering Based on Ensemble Classifier for University Enrolment Advising,” in 2019 11th International Conference on Knowledge and Smart Technology (KST), Phuket, Thailand, Jan. 2019, pp. 35–39. doi: 10.1109/KST.2019.8687616.",
    "order": 2
}, {
    "id": 3,
    "subject": "A Survey on the Multiple Classifier for New Benchmark Dataset of Vietnamese News Classification",
    "abstract": "In this paper, we have summarized the well-known multi-class classifiers in the literature and applied them to evaluate on a new benchmark dataset of Vietnamese News (VNNews-01). This database is created from more than thirty Vietnamese online newspaper websites and grouped into twenty five categories. The proposition and evaluation of this work might promote the related research for Vietnamese text mining.",
    "year": 2019,
    "doi": "http://dx.doi.org/10.1109/KST.2019.8687509",
    "authors": "Huu-Thanh Duong, Vinh Truong Hoang",
    "ref": "<strong>H.-T. Duong</strong> and V. Truong Hoang, “A Survey on the Multiple Classifier for New Benchmark Dataset of Vietnamese News Classification,” in 2019 11th International Conference on Knowledge and Smart Technology (KST), Phuket, Thailand, Jan. 2019, pp. 23–28. doi: 10.1109/KST.2019.8687509.",
    "order": 3
}, {
    "id": 4,
    "subject": "A Vietnamese Sentiment Analysis System Based on Multiple Classifiers with Enhancing Lexicon Features",
    "abstract": "Today, a customer is easy to express his opinions about a bought products thanks to accelerated development of social networks and ecommerce websites. These opinions are very useful indicators to evaluate the degree of the customers’ real satisfaction. From that, the traders will emerge the strategies and predict the trends to get the directions for their products and businesses in the future. In this paper, we have built a dataset and executed many experiments based on the multiple classifiers with complementing lexicon features to increase the accuracy of sentiment polarities. The experimental section shows good results and proves our approach is reasonable.",
    "year": 2020,
    "doi": "http://dx.doi.org/10.1007/978-3-030-30149-1_20",
    "authors": "Bich-Tuyen Nguyen-Thi, Huu-Thanh Duong",
    "ref": "B.-T. Nguyen-Thi and <strong>H.-T. Duong</strong>, “A Vietnamese Sentiment Analysis System Based on Multiple Classifiers with Enhancing Lexicon Features,” in Industrial Networks and Intelligent Systems, vol. 293, T. Q. Duong, N.-S. Vo, L. K. Nguyen, Q.-T. Vien, and V.-D. Nguyen, Eds. Cham: Springer International Publishing, 2019, pp. 240–249. doi: 10.1007/978-3-030-30149-1_20.",
    "order": 4
}, {
    "id": 5,
    "subject": "One-Document Training for Vietnamese Sentiment Analysis",
    "abstract": "The traditional studies which have based on machine learning are usually supervised learning for sentiment analysis problem, this is costly time and money to build pre-labeled dataset, not domain adaptation and hard to handle unseen data. In this paper, we have approached semi-supervised learning for Vietnamese sentiment analysis, training data is only one document. Many preprocessing techniques have been performed to clean and normalize data, complemented semantic lexicons such as negation handling, intensification handling, also augmented training data from one-document training. In experiments, we have performed various aspects and obtained competitive results which may motivate next propositions.",
    "year": 2020,
    "doi": "http://dx.doi.org/10.1007/978-3-030-34980-6_21",
    "authors": "Dang-Khoa Nguyen-Nhat, Huu-Thanh Duong",
    "ref": "D.-K. Nguyen-Nhat and <strong>H.-T. Duong</strong>, “One-Document Training for Vietnamese Sentiment Analysis,” in Computational Data and Social Networks, vol. 11917, A. Tagarelli and H. Tong, Eds. Cham: Springer International Publishing, 2019, pp. 189–200. doi: 10.1007/978-3-030-34980-6_21.",
    "order": 5
}, {
    "id": 6,
    "subject": "A review: preprocessing techniques and data augmentation for sentiment analysis",
    "abstract": "In literature, the machine learning-based studies of sentiment analysis are usually supervised learning which must have pre-labeled datasets to be large enough in certain domains. Obviously, this task is tedious, expensive and time-consuming to build, and hard to handle unseen data. This paper has approached semi-supervised learning for Vietnamese sentiment analysis which has limited datasets. We have summarized many preprocessing techniques which were performed to clean and normalize data, negation handling, intensification handling to improve the performances. Moreover, data augmentation techniques, which generate new data from the original data to enrich training data without user intervention, have also been presented. In experiments, we have performed various aspects and obtained competitive results which may motivate the next propositions.",
    "year": 2021,
    "doi": "https://computationalsocialnetworks.springeropen.com/articles/10.1186/s40649-020-00080-x",
    "authors": "Huu-Thanh Duong, Tram-Anh Nguyen-Thi",
    "ref": "<strong>H.-T. Duong</strong> and T.-A. Nguyen-Thi, “A review: preprocessing techniques and data augmentation for sentiment analysis,” Comput Soc Netw, vol. 8, no. 1, p. 1, Dec. 2021, doi: 10.1186/s40649-020-00080-x.",
    "order": 6
}, {
    "id": 7,
    "subject": "Text recognition for Vietnamese identity card based on deep features network",
    "abstract": "Optical character recognition (OCR) is a technology for converting text automatically on images into data strings for editing, indexing, and searching. The strings can be applied for many tasks such as to digitize old documents, translate into other languages, or to test and verify text positions. Recently, Know Your Customer (KYC) has become an industry standard for making sure that people are who they say they are. While the scope of Know Your Customer is constantly expanding, ID verification is still a crucial first step in KYC processes. Mobile OCR is one of the technological solutions that is making this part of KYC easier than ever for customers to comply with. KYC processes require financial services companies to verify the identities of their customers OCR to extract data by reading IDs, bank cards, and documents. In this paper, we investigate to develop a method for Vietnamese identity card recognition based on deep features network. On several major data fields of identity cards, it achieves an accuracy of more than 96.7% and 89.7% on character level and word level, respectively.",
    "year": 2021,
    "doi": "http://dx.doi.org/10.1007/s10032-021-00363-7",
    "authors": "Duc Phan Van Hoai, Huu-Thanh Duong, Vinh Truong Hoang",
    "ref": "Van Hoai, D.P., <strong>Duong, HT.</strong> & Hoang, V.T. Text recognition for Vietnamese identity card based on deep features network. IJDAR 24, 123–131 (2021). https://doi.org/10.1007/s10032-021-00363-7",
    "order": 7
}, {
    "id": 8,
    "subject": "A comparative study of rice variety classification based on deep learning and hand-crafted features",
    "abstract": "Rice is vital to people all around the world. The demand for an efficient method in rice seed variety classification is one of the most essential tasks for quality inspection. Currently, this task is done by technicians based on experience by investigating the similarity of colour, shape and texture of rice. Therefore, we propose to find an appropriate process to develop an automation system for rice recognition. In this paper, several hand-crafted descriptors and Convolutional Neural Networks (CNN) methods are evaluated and compared. The experiment is simulated on the VNRICE dataset on which our method shows a significant result. The highest accuracy obtained is 99.04% by using DenNet21 framework.",
    "year": 2020,
    "doi": "http://dx.doi.org/10.37936/ecti-cit.2020141.204170",
    "authors": "Duc Phan Van Hoai, Thongchai Surinwarangkoon, Vinh Truong Hoang, Huu-Thanh Duong, Kittikhun Meethongjan",
    "ref": "V. Truong Hoang, D. P. Van Hoai, T. Surinwarangkoon, <strong>H.-T. Duong</strong>, and K. Meethongjan, “A Comparative Study of Rice Variety Classification based on Deep Learning and Hand-crafted Features”, ECTI-CIT, vol. 14, no. 1, pp. 1-10, Mar. 2020.",
    "order": 8
}, {
    "id": 9,
    "subject": "Dimensionality Reduction Based on Feature Selection for Rice Varieties Recognition",
    "abstract": "Rice is a primary source of people all around the world. Rice quality is mainly depend on the genetic characteristics of a rice variety. One of the most important tasks for quality control of rice production is rice seed classification. We present an approach for rice seed images classification based on Histogram of Oriented Gradient descriptor and feature selection. The experiment is applied on a VNRICE benchmark dataset and show the efficiency of the proposed approach by reducing the number of selected features and increasing the accuracy.",
    "year": 2019,
    "doi": "http://dx.doi.org/10.1109/INCIT.2019.8912121",
    "authors": "Huu-Thanh Duon, Vinh Truong Hoang",
    "ref": "<strong>H. Duong</strong> and V. T. Hoang, “Dimensionality Reduction Based on Feature Selection for Rice Varieties Recognition,” 2019 4th International Conference on Information Technology (InCIT), 2019, pp. 199-202, doi: 10.1109/INCIT.2019.8912121.",
    "order": 9
}, {
    "id": 10,
    "subject": "Data Augmentation Based on Color Features for Limited Training Texture Classification",
    "abstract": "Image classification problem requires a large number of labeled training images to obtain a good generalization. However, it is very time consuming and expensive to label data. The color information has been demonstrated that it contains relevant information for characterizing texture image. This paper presents a novel data augmentation method dedicated to color texture classification. We firstly use color features extracted from different color spaces to augment data in case of one sample training per class. The experimental results is very promising since it significantly improves the classification performance on four benchmark color texture datasets.",
    "year": 2019,
    "doi": "http://dx.doi.org/10.1109/INCIT.2019.8911934",
    "authors": "Huu-Thanh Duong, Vinh Truong Hoang",
    "ref": "<strong>H. Duong</strong> and V. T. Hoang, “Data Augmentation Based on Color Features for Limited Training Texture Classification,” 2019 4th International Conference on Information Technology (InCIT), 2019, pp. 208-211, doi: 10.1109/INCIT.2019.8911934.",
    "order": 10
}, {
    "id": 11,
    "subject": "The Impacts of the Contextual Substitutions in Vietnamese Micro-text Augmentation",
    "abstract": "The deep learning models rely on a huge amount of annotated training data to learn multiple layers of the features or representations and also avoid overfitting. However, the annotated dataset is unavailable, especially for the low resource languages. Building them is a tedious, time-consuming and expensive task. Thus, data augmentation has been mentioned as a perfect approach to generate the annotated data from the limited data without user intervention. In this paper, we evaluate the importances and the impacts of the contextual words to enhance the training data based on a pre-trained model which we build based on the reviews extracting the e-commerce websites in Vietnamese. We experiment on the sentiment analysis problem to evaluate the effectiveness of our approach.",
    "year": 2022,
    "doi": "https://doi.org/10.1007/978-3-030-92942-8_3",
    "authors": "Huu-Thanh Duong, Trung-Kiet Tran",
    "ref": "<strong>Duong HT.</strong>, Tran TK. (2021) The Impacts of the Contextual Substitutions in Vietnamese Micro-text Augmentation. In: Cong Vinh P., Huu Nhan N. (eds) Nature of Computation and Communication. ICTCC 2021. Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering, vol 408. Springer, Cham. https://doi.org/10.1007/978-3-030-92942-8_3",
    "order": 11
}, {
    "id": 12,
    "subject": "An Approach for Multiple Choice Question Answering System",
    "abstract": "Multiple choice question (MCQ) system, which is a form of question answering system, includes a question, a set of choices and the correct answers from these choices. The rapidly growth of linguistics models improves natural language understanding and motivates the automatic systems in natural language processing. This paper proposes an approach based on the Language Model for MCQ system as incomplete questions in English tests. This not only reduces the burden of human experts to teach their students, but also is useful for self-studying the students. We perform many experiments to evaluate the effectiveness and achieve 85.45% accuracy for our proposal.",
    "year": 2022,
    "doi": "https://doi.org/10.1007/978-3-030-92942-8_7",
    "authors": "Dinh-Huy Vo. Anh-Khoa Do-Vo, Tram-Anh Nguyen-Thi, Huu-Thanh Duong",
    "ref": "Vo DH., Do-Vo AK., Nguyen-Thi TA., <strong>Duong HT.</strong> (2021) An Approach for Multiple Choice Question Answering System. In: Cong Vinh P., Huu Nhan N. (eds) Nature of Computation and Communication. ICTCC 2021. Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering, vol 408. Springer, Cham. https://doi.org/10.1007/978-3-030-92942-8_7",
    "order": 12
}, {
    "id": 13,
    "subject": "Data-driven Modeling and Dynamic Analysis of Complex Networks: Applications to Social Networks",
    "abstract": "The annotated dataset is an essential requirement to develop an artificial intelligence (AI) system effectively and expect the generalization of the predictive models and to avoid overfitting. Lack of the training data is a big barrier so that AI systems can broaden in several domains which have no or missing training data. Building these datasets is a tedious and expensive task and depends on the domains and languages. This is especially a big challenge for low-resource languages. In this paper, we experiment and evaluate many various approaches on sentiment analysis problems so that they can still obtain high performances under limited training data. This paper uses the preprocessing techniques to clean and normalize the data and generate the new samples from the limited training dataset based on many text augmentation techniques such as lexicon substitution, sentence shuffling, back translation, syntax-tree transformation, and embedding mixup. Several experiments have been performed for both well-known machine learning-based classifiers and deep learning models. We compare, analyze, and evaluate the results to indicate the advantage and disadvantage points of the techniques for each approach. The experimental results show that the data augmentation techniques enhance the accuracy of the predictive models; this promises that smart systems can be applied widely in several domains under limited training data.",
    "year": 2022,
    "doi": "https://doi.org/10.1155/2022/3188449",
    "authors": "Huu-Thanh Duong, Tram-Anh Nguyen-Thi,  and Vinh Truong Hoang",
    "ref": "<strong>Huu-Thanh Duong</strong>, Tram-Anh Nguyen-Thi, Vinh Truong Hoang, Vietnamese Sentiment Analysis under Limited Training Data Based on Deep Neural Networks, Complexity, vol. 2022, Article ID 3188449, 14 pages, 2022. https://doi.org/10.1155/2022/3188449",
    "order": 13
}]
